ashutoshnaik/sigma_mbed/DesignAndCode/MAX32600MBED_GSR/Firmware_Design_Files/RD73_MAX32600_V02_00/Design_Files/MAXREFDES73/BLE_Wicentric/stack/include/hci_defs.h
#define HCI_LEN_SET_EVENT_MASK            8
#define HCI_LEN_RESET                     0
#define HCI_LEN_READ_TX_PWR_LVL           3
#define HCI_LEN_SET_CONTROLLER_TO_HOST_FC 1
#define HCI_LEN_HOST_BUFFER_SIZE          8
#define HCI_LEN_HOST_NUM_CMPL_PKTS        1

#define HCI_LEN_READ_LOCAL_VER_INFO       0
#define HCI_LEN_READ_LOCAL_SUP_CMDS       0
#define HCI_LEN_READ_LOCAL_SUP_FEAT       0
#define HCI_LEN_READ_BUF_SIZE             0
#define HCI_LEN_READ_BD_ADDR              0

#define HCI_LEN_READ_RSSI                 2

#define HCI_LEN_LE_SET_EVENT_MASK         8
#define HCI_LEN_LE_READ_BUF_SIZE          0
#define HCI_LEN_LE_READ_LOCAL_SUP_FEAT    0
#define HCI_LEN_LE_SET_RAND_ADDR          6
#define HCI_LEN_LE_SET_ADV_PARAM          15
#define HCI_LEN_LE_READ_ADV_TX_POWER      0
#define HCI_LEN_LE_SET_ADV_DATA           32
#define HCI_LEN_LE_SET_SCAN_RESP_DATA     32
#define HCI_LEN_LE_SET_ADV_ENABLE         1
#define HCI_LEN_LE_SET_SCAN_PARAM         7
#define HCI_LEN_LE_SET_SCAN_ENABLE        2
#define HCI_LEN_LE_CREATE_CONN            25
#define HCI_LEN_LE_CREATE_CONN_CANCEL     0
#define HCI_LEN_LE_READ_WHITE_LIST_SIZE   0
#define HCI_LEN_LE_CLEAR_WHITE_LIST       0
#define HCI_LEN_LE_ADD_DEV_WHITE_LIST     7
#define HCI_LEN_LE_REMOVE_DEV_WHITE_LIST  7
#define HCI_LEN_LE_CONN_UPDATE            14
#define HCI_LEN_LE_SET_HOST_CHAN_CLASS    5
#define HCI_LEN_LE_READ_CHAN_MAP          2
#define HCI_LEN_LE_READ_REMOTE_FEAT       2
#define HCI_LEN_LE_ENCRYPT                32
#define HCI_LEN_LE_RAND                   0
#define HCI_LEN_LE_START_ENCRYPTION       28
#define HCI_LEN_LE_LTK_REQ_REPL           18
#define HCI_LEN_LE_LTK_REQ_NEG_REPL       2
#define HCI_LEN_LE_READ_SUP_STATES        0
#define HCI_LEN_LE_RECEIVER_TEST          1
#define HCI_LEN_LE_TRANSMITTER_TEST       3
#define HCI_LEN_LE_TEST_END               0

/*! Events */
#define HCI_DISCONNECT_CMPL_EVT           0x05
#define HCI_ENC_CHANGE_EVT                0x08
#define HCI_READ_REMOTE_VER_INFO_CMPL_EVT 0x0C
#define HCI_CMD_CMPL_EVT                  0x0E
#define HCI_CMD_STATUS_EVT                0x0F
#define HCI_HW_ERROR_EVT                  0x10
#define HCI_NUM_CMPL_PKTS_EVT             0x13
#define HCI_DATA_BUF_OVERFLOW_EVT         0x1A
#define HCI_ENC_KEY_REFRESH_CMPL_EVT      0x30
#define HCI_LE_META_EVT                   0x3E
#define HCI_VENDOR_SPEC_EVT               0xFF

/*! LE Subevents */
#define HCI_LE_CONN_CMPL_EVT              0x01
#define HCI_LE_ADV_REPORT_EVT             0x02
#define HCI_LE_CONN_UPDATE_CMPL_EVT       0x03
#define HCI_LE_READ_REMOTE_FEAT_CMPL_EVT  0x04
#define HCI_LE_LTK_REQ_EVT                0x05

/*! Event parameter lengths */
#define HCI_LEN_DISCONNECT_CMPL           4
#define HCI_LEN_ENC_CHANGE                5
#define HCI_LEN_LE_CONN_CMPL              19
#define HCI_LEN_LE_CONN_UPDATE_CMPL       9
#define HCI_LEN_LE_READ_REMOTE_FEAT_CMPL  12
#define HCI_LEN_LE_LTK_REQ                13

/*! Supported commands */
#define HCI_SUP_DISCONNECT                0x20      /*! Byte 0 */
#define HCI_SUP_READ_REMOTE_VER_INFO      0x80      /*! Byte 2 */
#define HCI_SUP_SET_EVENT_MASK            0x40      /*! Byte 5 */
#define HCI_SUP_RESET                     0x80      /*! Byte 5 */
#define HCI_SUP_READ_TX_PWR_LVL           0x04      /*! Byte 10 */
#define HCI_SUP_SET_CONTROLLER_TO_HOST_FC 0x20      /*! Byte 10 */
#define HCI_SUP_HOST_BUFFER_SIZE          0x40      /*! Byte 10 */
#define HCI_SUP_HOST_NUM_CMPL_PKTS        0x80      /*! Byte 10 */
#define HCI_SUP_READ_LOCAL_VER_INFO       0x08      /*! Byte 14 */
#define HCI_SUP_READ_LOCAL_SUP_FEAT       0x10      /*! Byte 14 */
#define HCI_SUP_READ_BD_ADDR              0x02      /*! Byte 15 */
#define HCI_SUP_READ_RSSI                 0x20      /*! Byte 15 */
#define HCI_SUP_LE_SET_EVENT_MASK         0x01      /*! Byte 25 */
#define HCI_SUP_LE_READ_BUF_SIZE          0x02      /*! Byte 25 */
#define HCI_SUP_LE_READ_LOCAL_SUP_FEAT    0x04      /*! Byte 25 */
#define HCI_SUP_LE_SET_RAND_ADDR          0x10      /*! Byte 25 */
#define HCI_SUP_LE_SET_ADV_PARAM          0x20      /*! Byte 25 */
#define HCI_SUP_LE_READ_ADV_TX_POWER      0x40      /*! Byte 25 */
#define HCI_SUP_LE_SET_ADV_DATA           0x80      /*! Byte 25 */
#define HCI_SUP_LE_SET_SCAN_RESP_DATA     0x01      /*! Byte 26 */
#define HCI_SUP_LE_SET_ADV_ENABLE         0x02      /*! Byte 26 */
#define HCI_SUP_LE_SET_SCAN_PARAM         0x04      /*! Byte 26 */
#define HCI_SUP_LE_SET_SCAN_ENABLE        0x08      /*! Byte 26 */
#define HCI_SUP_LE_CREATE_CONN            0x10      /*! Byte 26 */
#define HCI_SUP_LE_CREATE_CONN_CANCEL     0x20      /*! Byte 26 */
#define HCI_SUP_LE_READ_WHITE_LIST_SIZE   0x40      /*! Byte 26 */
#define HCI_SUP_LE_CLEAR_WHITE_LIST       0x80      /*! Byte 26 */
#define HCI_SUP_LE_ADD_DEV_WHITE_LIST     0x01      /*! Byte 27 */
#define HCI_SUP_LE_REMOVE_DEV_WHITE_LIST  0x02      /*! Byte 27 */
#define HCI_SUP_LE_CONN_UPDATE            0x04      /*! Byte 27 */
#define HCI_SUP_LE_SET_HOST_CHAN_CLASS    0x08      /*! Byte 27 */
#define HCI_SUP_LE_READ_CHAN_MAP          0x10      /*! Byte 27 */
#define HCI_SUP_LE_READ_REMOTE_FEAT       0x20      /*! Byte 27 */
#define HCI_SUP_LE_ENCRYPT                0x40      /*! Byte 27 */
#define HCI_SUP_LE_RAND                   0x80      /*! Byte 27 */
#define HCI_SUP_LE_START_ENCRYPTION       0x01      /*! Byte 28 */
#define HCI_SUP_LE_LTK_REQ_REPL           0x02      /*! Byte 28 */
#define HCI_SUP_LE_LTK_REQ_NEG_REPL       0x04      /*! Byte 28 */
#define HCI_SUP_LE_READ_SUP_STATES        0x08      /*! Byte 28 */
#define HCI_SUP_LE_RECEIVER_TEST          0x10      /*! Byte 28 */
#define HCI_SUP_LE_TRANSMITTER_TEST       0x20      /*! Byte 28 */
#define HCI_SUP_LE_TEST_END               0x40      /*! Byte 28 */
                                               
/*! Event mask */                               
#define HCI_EVT_MASK_DISCONNECT_CMPL            0x10   /*! Byte 0 */
#define HCI_EVT_MASK_ENC_CHANGE                 0x80   /*! Byte 0 */
#define HCI_EVT_MASK_READ_REMOTE_VER_INFO_CMPL  0x08   /*! Byte 1 */
#define HCI_EVT_MASK_HW_ERROR                   0x80   /*! Byte 1 */
#define HCI_EVT_MASK_DATA_BUF_OVERFLOW          0x02   /*! Byte 3 */
#define HCI_EVT_MASK_ENC_KEY_REFRESH_CMPL       0x80   /*! Byte 5 */
#define HCI_EVT_MASK_LE_META                    0x20   /*! Byte 7 */

/*! LE event mask */
#define HCI_EVT_MASK_LE_CONN_CMPL_EVT              0x01   /*! Byte 0 */
#define HCI_EVT_MASK_LE_ADV_REPORT_EVT             0x02   /*! Byte 0 */
#define HCI_EVT_MASK_LE_CONN_UPDATE_CMPL_EVT       0x04   /*! Byte 0 */
#define HCI_EVT_MASK_LE_READ_REMOTE_FEAT_CMPL_EVT  0x08   /*! Byte 0 */
#define HCI_EVT_MASK_LE_LTK_REQ_EVT                0x10   /*! Byte 0 */

/*! LE supported features */
#define HCI_LE_SUP_FEAT_ENCRYPTION        0x01

